create table temp_review
(movie_name_russian varchar(1000),
 user_name varchar(1000),
 review_text varchar(4000));

insert into temp_review values(
'Побег из Шоушенка',
'Дарлин Эдвардс',
'Гениальное кино! Смотришь и думаешь «Так не бывает!», но позже понимаешь, что только так и должно быть. Начинаешь заново осмысливать значение фразы, которую постоянно используешь в своей жизни, «Надежда умирает последней». Ведь если ты не надеешься, то все в твоей жизни гаснет, не остается смысла. Фильм наполнен бесконечным числом правильных афоризмов. Я уверена, что буду пересматривать его сотни раз.');

insert into temp_review values(
'Побег из Шоушенка',
'Габриэль Джексон',
'Кино это является, безусловно, «со знаком качества». Что же до первого места в рейтинге, то, думаю, здесь имело место быть выставление «десяточек» от большинства зрителей вкупе с раздутыми восторженными откликами кинокритиков. Фильм атмосферный. Он драматичный. И, конечно, заслуживает того, чтобы находиться довольно высоко в мировом кинематографе.');

insert into temp_review values(
'Зеленая миля',
'Рональд Рейнольдс',
'Перестал удивляться тому, что этот фильм занимает сплошь первые места во всевозможных кино рейтингах. Особенно я люблю когда при экранизации литературного произведение из него в силу специфики кинематографа исчезает ирония и появляется некий сверхреализм, обязанный удерживать зрителя у экрана каждую отдельно взятую секунду.');

insert into temp_review values(
'Форрест Гамп',
'Нил Паркер',
'Много еще можно сказать об этом шедевре. И то, что он учит верить, и то, чтобы никогда не сдаваться… Но самый главный девиз я увидел вот в этой фразе: «Занимайся жизнью, или занимайся смертью».');

insert into temp_review values(
'Список Шиндлера',
'Трэвис РайтОчень хороший фильм, необычный сюжет, я бы даже сказала непредсказуемый. Такие фильмы уже стали редкостью.');

insert into temp_review values(
'1+1',
'Джесси Паттерсон',
'У меня не найдётся слов, чтобы описать этот фильм. Не хочется быть банальной и говорить какой он отличный, непредсказуемый и т. д., но от этого никуда не деться к сожалению — ведь он ШЕДЕВРАЛЬНЫЙ!');

insert into temp_review values(
'1+1',
'Амелия Кэннеди',
'Скажу сразу — фильм выглядел многообещающе, даже если не брать в расчет что он находился в топе-250 лучших фильмов. Известные голливудские актеры на главных ролях. Но нет в этом фильме должной атмосферы. Нет такого чувства что вот сейчас случится что-то страшное. Что герои попали в ситуацию из которой не смогут выбраться. В общем, не понравилось.');

insert into temp_review values(
'Жизнь прекрасна',
'Габриэль Джексон',
'«Все должно быть супер! Супер! Су-пер!» И это именно супер, ну слов других не подберешь.');

insert into temp_review values(
'Бойцовский клуб',
'Деннис Крейг',
'Фильм очень красивый. Не во всем, конечно, но яркие персонажи и костюмы — это уже кое-что.');

insert into temp_review values(
'Как приручить дракона',
'Габриэль Джексон',
'Этот фильм из разряда тех, что могут обеспечить хороший отдых и приподнятое настроение за счёт своей лёгкости, совсем непошлого юмора, умеренной дозы напряжения, динамики нужных скоростей.');

insert into temp_review values(
'Как приручить дракона',
'Нил Паркер',
'Назначается Киношедевром среди развлекательных фильмов.');

insert into temp_review values(
'Гладиатор',
'Амелия Кэннеди',
'Данный кинофильм — нестареющая классика мирового кинематографа, который можно пересматривать до бесконечности и, что удивительно, он не может надоесть.');

insert into temp_review values(
'Темный рыцарь',
'Дэрил Брайант',
'Рекомендую смотреть всем и не обращать внимания на надоевшее уже спасение целого мира одним человеком.');

insert into temp_review values(
'Большой куш',
'Дэрил Брайант',
'Удивлен. Никто не отозвался плохо? Неужели было создано произведение искусства, которое нравится всем, и которое совершенно? Нет. Может, я один такой? Фильм не вызывает во мне никаких эмоций. Неплохая сказочка. Замечательная наивная атмосфера. Местами есть забавные шутки. И, как мне показалось, этот фильм — своего рода стёб над другими боевиками. При этом превосходящий многие боевики.');

insert into temp_review values(
'Унесённые призраками',
'Деннис Крейг',
'Необыкновенно позитивный фильм. Его можно пересматривать много раз для поднятия настроения, находя много смешных, незаметных на первый взгляд моментов.');

insert into temp_review values(
'Звёздные войны: Эпизод 4 – Новая надежда',
'Амелия Кэннеди',
'Легендарный. Культовый. Бессмертный. Три слова. Всего лишь три. А сколько же они выражают неподдельных эмоций и радостных впечатлений по отношению к очередному любимому и уважаемому фильму из минувшего в лету детства? Много. Слишком много. И описать эти сердечные и гарцующие в здравом рассудке чувства обыкновенными строчными предложениями иногда не представляется возможным.');

insert into temp_review values(
'Большой куш',
'Трэвис Райт',
'Приятного просмотра для всех, кто не видел ещё этого шедевра больше впечатлений для тех, кто пересматривает в надцатый раз. =)');

insert into temp_review values(
'Большой куш',
'Нил Паркер',
'Это один из любимых моих фильмов с самого детства. Я видела его столько раз, что знаю практически наизусть. И могу сказать с уверенностью, что посмотрю еще не один раз.');

insert into temp_review values(
'Молчание ягнят',
'Габриэль Джексон',
'Фильм, безусловно, посмотрела уже большая часть населения, которая хоть каким-то образом имеет отношение к кинематографу. Я считаю, что фильм можно пересмотреть еще не один раз.');

insert into temp_review values(
'Как приручить дракона',
'Айда Дэвис',
'Фильм продуман до мельчайших деталей. Идеальный фильм для улучшения настроения, единственный в своем роде. Обязателен к просмотру!');

insert into temp_review values(
'Блеф',
'Нил Паркер',
'Фильм потрясающий, в нем хватает абсолютно всего: и драк, и музыки, и юмора, и любви.');

insert into temp_review values(
'Гран Торино',
'Рональд Рейнольдс',
'У фильма есть свои мелкие недостатки  и неточности, но многочисленные достоинства в несколько раз перевешивают. Много вдохновляющего креатива!');

insert into temp_review values(
'Молчание ягнят',
'Дарлин Эдвардс',
'Хоть и не по возрасту мне заводить скрипучую пластинку с мелодией «Раньше и деревья были выше, и трава зеленее…», а хочется. Выражать свою любовь к настолько близкому произведению крайне сложно.');

insert into temp_review values(
'Блеф',
'Айда Дэвис',
'Вердикт: прекрасная, нестареющая классика, которая рекомендована мною для всех.');

insert into temp_review values(
'Хороший, плохой, злой',
'Дэрил Брайант',
'Для воскресного вечернего просмотра подходит по всем критериям.');

insert into temp_review values(
'Укрощение строптивого',
'Нил Паркер',
'Хороший и по-настоящему интересный фильм, с хорошим сюжетом и неплохим музыкальным сопровождением. Всем советую к просмотру.');

insert into temp_review values(
'Джанго освобожденный',
'Трэвис Райт',
'Полагаю, этот фильм должен быть в коллекции каждого уважающего себя киномана.');

insert into temp_review values(
'Танцующий с волками',
'Амелия Кэннеди',
'Нетленный шедевр мирового кинематографа, который можно пересматривать десятки раз и получать все такой — же, извините за выражение, кайф от просмотра. Минусы у фильма, конечно, есть, но черт возьми. Их просто не хочется замечать! Ты настолько поглощен просмотром фильма, что просто не хочется придираться к разным мелочам.');

insert into temp_review values(
'Джанго освобожденный',
'Айда Дэвис',
'Фильм только выигрывает от частого просмотра и всегда поднимает мне настроение (наряду с драмой, тут еще и тонкий юмор).');

insert into temp_review values(
'Укрощение строптивого',
'Джесси Паттерсон',
'Конечно, бесспорно культовый фильм, не реалистичный, наивный, где то глупый, но такой же увлекательный и удивительный, как и много лет назад');

insert into temp_review values(
'Титаник',
'Джесси Паттерсон',
'В итоге мы имеем отличный представитель своего жанра, который прошёл проверку временем и до сих пор отлично смотрится, несмотря на классический сюжет');

insert into temp_review values(
'Пролетая над гнездом кукушки',
'Деннис Крейг',
'Скажу только одно — как я жалею, что не посмотрела его раньше!');


insert into review(movie_id, user_id, review_text)
select m.movie_id, u.user_id, t.review_text
  from temp_review t, movie m, app_user u
 where t.movie_name_russian = m.movie_name_russian
   and t.user_name = u.user_first_name || ' ' || u.user_last_name;

drop table temp_review;